Revit 2024 API
Wood.WoodThickness Property
 The property labeled "Grain Thickness" from the "Wood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string WoodThickness { get; }
Visual Basic
Public Shared ReadOnly Property WoodThickness As String
	Get
Visual C++
public:
static property String^ WoodThickness {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 100".
See Also
Wood Class
Autodesk.Revit.DB.Visual Namespace